# Brewfile — mac-setup
# Run: brew bundle --file=Brewfile

tap "homebrew/cask-fonts"

# ── CLI Tools ─────────────────────────────────────────────────────────────────
brew "git"
brew "git-lfs"
brew "gh"
brew "curl"
brew "wget"
brew "tree"
brew "jq"
brew "yq"
brew "bat"
brew "eza"
brew "fd"
brew "fzf"
brew "ripgrep"
brew "zoxide"
brew "tldr"
brew "htop"
brew "watch"
brew "gnupg"
brew "openssh"

# ── Shell ─────────────────────────────────────────────────────────────────────
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "starship"
brew "tmux"
brew "neovim"

# ── Dev ───────────────────────────────────────────────────────────────────────
brew "python@3.12"
brew "pyenv"
brew "pipx"
brew "node"
brew "nvm"
brew "maven"
brew "gradle"
brew "kotlin"
brew "openjdk@21"

# ── Cloud / Infra ─────────────────────────────────────────────────────────────
brew "awscli"
brew "terraform"
brew "docker-compose"

# ── Version management ────────────────────────────────────────────────────────
brew "mise"

# ── Fonts ─────────────────────────────────────────────────────────────────────
cask "font-jetbrains-mono-nerd-font"

# ── GUI Apps ──────────────────────────────────────────────────────────────────
cask "iterm2"
cask "visual-studio-code"
cask "sublime-text"
cask "intellij-idea-ce"
cask "docker"
cask "rectangle"
cask "raycast"
cask "postman"
